In [1]:
import pandas as pd

In [2]:
a = [1, 2, 3]
myvar = pd.Series(a)
print(myvar)

0    1
1    2
2    3
dtype: int64

In [3]:
myvar[1]

2

In [5]:
a = ["Google", "Runoob", "Wiki"]
# 指定自定义索引
myvar = pd.Series(a, index = ["x", "y", "z"])
print(myvar)

x    Google
y    Runoob
z      Wiki
dtype: object

In [8]:
sites = {1: "Google", 2: "Runoob", 3: "Wiki"}
#  kev/value 方式创建 series
myvar = pd.Series(sites)
print(myvar)

1    Google
2    Runoob
3      Wiki
dtype: object

In [10]:
data = [['Google',10],['Runoob',12],['Wiki',13]]
df = pd.DataFrame(data,columns=['Site','Age'],dtype=float)
print(df)

     Site   Age
0  Google  10.0
1  Runoob  12.0
2    Wiki  13.0

In [12]:
data = {'Site':['Google', 'Runoob', 'Wiki'], 'Age':[10, 12, 13]}
df = pd.DataFrame(data)
df

     Site  Age
0  Google   10
1  Runoob   12
2    Wiki   13

In [16]:

data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}
# 数据载入到 DataFrame 对象
df = pd.DataFrame(data)
# 返回第一行和第二行
df

   calories  duration
0       420        50
1       380        40
2       390        45

In [17]:
df.loc[[0, 1]]

   calories  duration
0       420        50
1       380        40

In [19]:

# 三个字段 name, site, age
nme = ["Google", "Runoob", "Taobao", "Wiki"]
st = ["www.google.com", "www.runoob.com", "www.taobao.com", "www.wikipedia.org"]
ag = [90, 40, 80, 98]
   
# 字典
dict = {'name': nme, 'site': st, 'age': ag}

df = pd.DataFrame(dict)
# 保存 dataframe
df.to_csv('data_file/site.csv')

In [22]:
df = pd.read_csv('data_file/site.csv')
df.head()

   Unnamed: 0    name               site  age
0           0  Google     www.google.com   90
1           1  Runoob     www.runoob.com   40
2           2  Taobao     www.taobao.com   80
3           3    Wiki  www.wikipedia.org   98

In [26]:
df.tail(2) # 不指定N默认返回最后五行

   Unnamed: 0    name               site  age
2           2  Taobao     www.taobao.com   80
3           3    Wiki  www.wikipedia.org   98

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  4 non-null      int64
 1   name        4 non-null      object
 2   site        4 non-null      object
 3   age         4 non-null      int64
dtypes: int64(2), object(2)
memory usage: 256.0+ bytes

In [34]:

json_data = pd.read_json('data_file/sites.json')
json_data

     id    name             url  likes
0  A001    菜鸟教程  www.runoob.com     61
1  A002  Google  www.google.com    124
2  A003      淘宝  www.taobao.com     45

In [36]:
print(json_data.to_string())

     id    name             url  likes
0  A001    菜鸟教程  www.runoob.com     61
1  A002  Google  www.google.com    124
2  A003      淘宝  www.taobao.com     45

In [38]:
json_df = pd.DataFrame(json_data)
json_df

     id    name             url  likes
0  A001    菜鸟教程  www.runoob.com     61
1  A002  Google  www.google.com    124
2  A003      淘宝  www.taobao.com     45

In [40]:
URL = 'https://static.runoob.com/download/sites.json' #从url中加载json
url_json = pd.read_json(URL)
url_json

     id    name             url  likes
0  A001    菜鸟教程  www.runoob.com     61
1  A002  Google  www.google.com    124
2  A003      淘宝  www.taobao.com     45

In [45]:
url_json_df = pd.DataFrame(url_json) # json 转 dataFrame
url_json_df

     id    name             url  likes
0  A001    菜鸟教程  www.runoob.com     61
1  A002  Google  www.google.com    124
2  A003      淘宝  www.taobao.com     45

In [48]:
nested_json = pd.read_json('data_file/nested_list.json')
nested_json

,school_name,class,students
0,ABC primary school,Year 1,"{'id': 'A001', 'name': 'Tom', 'math': 60, 'phy..."
1,ABC primary school,Year 1,"{'id': 'A002', 'name': 'James', 'math': 89, 'p..."
2,ABC primary school,Year 1,"{'id': 'A003', 'name': 'Jenny', 'math': 79, 'p..."

In [52]:
import json
# 使用 Python JSON 模块载入数据
with open('data_file/nested_list.json','r') as f:
    data = json.loads(f.read())
# 展平数据
df_nested_list = pd.json_normalize(data, record_path =['students'],meta=['school_name', 'class'])
print(df_nested_list)

     id   name  math  physics  chemistry         school_name   class
0  A001    Tom    60       66         61  ABC primary school  Year 1
1  A002  James    89       76         51  ABC primary school  Year 1
2  A003  Jenny    79       90         78  ABC primary school  Year 1

In [58]:
missing_values = ["n/a", "na", "--"] # 指定空数据类型
property_df = pd.read_csv('data_file/property-data.csv',na_values = missing_values)
print (property_df['NUM_BEDROOMS'])
print (property_df['NUM_BEDROOMS'].isnull())

0    3.0
1    3.0
2    NaN
3    1.0
4    3.0
5    NaN
6    2.0
7    1.0
8    NaN
Name: NUM_BEDROOMS, dtype: float64
0    False
1    False
2     True
3    False
4    False
5     True
6    False
7    False
8     True
Name: NUM_BEDROOMS, dtype: bool

In [69]:
df = pd.read_csv('data_file/property-data.csv')
new_df = df.dropna() # 返回新数据，不修改源数据
print("源数据:\n",df.to_string())
print("新数据:\n",new_df.to_string())

df.dropna(inplace = True)
print("源数据被修改为：\n",df.to_string())

源数据:
            PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY           12            1      NaN   700
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y            1        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800
新数据:
            PID  ST_NUM    ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0     PUTNAM            Y            3        1  1000
1  100002000.0   197.0  LEXINGTON            N            3      1.5    --
8  100009000.0   215.0    TREMONT            Y           na        2  1800
源数据被修改为：
            PID  ST_NUM    ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0     PUTNAM            Y            3        1  1000
1  100002000.0   197.0  LEXINGTON            N            3      1.5    --
8  100009000.0   215.0    TREMONT            Y           na        2  1800

In [74]:
import pandas as pd

df = pd.read_csv('data_file/property-data.csv')
# 移除ST_NUM列字段为空的值
df.dropna(subset=['ST_NUM'], inplace = True)
print(df.to_string())

           PID  ST_NUM    ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0     PUTNAM            Y            3        1  1000
1  100002000.0   197.0  LEXINGTON            N            3      1.5    --
3  100004000.0   201.0   BERKELEY           12            1      NaN   700
4          NaN   203.0   BERKELEY            Y            3        2  1600
5  100006000.0   207.0   BERKELEY            Y          NaN        1   800
7  100008000.0   213.0    TREMONT            Y            1        1   NaN
8  100009000.0   215.0    TREMONT            Y           na        2  1800

In [76]:
df = pd.read_csv('data_file\property-data.csv')
df.fillna(12345, inplace = True) #用12345替换空串
print(df.to_string())

           PID   ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH  SQ_FT
0  100001000.0    104.0      PUTNAM            Y            3        1   1000
1  100002000.0    197.0   LEXINGTON            N            3      1.5     --
2  100003000.0  12345.0   LEXINGTON            N        12345        1    850
3  100004000.0    201.0    BERKELEY           12            1    12345    700
4      12345.0    203.0    BERKELEY            Y            3        2   1600
5  100006000.0    207.0    BERKELEY            Y        12345        1    800
6  100007000.0  12345.0  WASHINGTON        12345            2   HURLEY    950
7  100008000.0    213.0     TREMONT            Y            1        1  12345
8  100009000.0    215.0     TREMONT            Y           na        2   1800

In [80]:
df = pd.read_csv('data_file\property-data.csv')
#只替换指定列的空数据
df['PID'].fillna(12345, inplace = True)
print(df.to_string())

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY           12            1      NaN   700
4      12345.0   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y            1        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

In [91]:
# 使用 mean() 方法计算列的均值并替换空单元格：
import pandas as pd
df = pd.read_csv('data_file\property-data.csv')
#计算均值
x = df["ST_NUM"].mean()
print("均值:",x)
#计算中位数
m = df["ST_NUM"].median()
print("中位数:",m)
mode = df["ST_NUM"].mode()
#众数返回的是一个列表，众数有可能是多个
print("众数:\n",mode)
print("=========================\n")
#替换列
df["ST_NUM"].fillna(x, inplace = True)
print(df.to_string())

均值: 191.42857142857142
中位数: 203.0
众数:
 0    104.0
1    197.0
2    201.0
3    203.0
4    207.0
5    213.0
6    215.0
dtype: float64
=========================

           PID      ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0  104.000000      PUTNAM            Y            3        1  1000
1  100002000.0  197.000000   LEXINGTON            N            3      1.5    --
2  100003000.0  191.428571   LEXINGTON            N          NaN        1   850
3  100004000.0  201.000000    BERKELEY           12            1      NaN   700
4          NaN  203.000000    BERKELEY            Y            3        2  1600
5  100006000.0  207.000000    BERKELEY            Y          NaN        1   800
6  100007000.0  191.428571  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0  213.000000     TREMONT            Y            1        1   NaN
8  100009000.0  215.000000     TREMONT            Y           na        2  1800

In [93]:
# 第三个日期格式错误
data = {
  "Date": ['2020/12/01', '2020/12/02' , '20201226'],
  "duration": [50, 40, 45]
}

df = pd.DataFrame(data, index = ["day1", "day2", "day3"])

#统一转化为日期格式
df['Date'] = pd.to_datetime(df['Date'])

print(df.to_string())

           Date  duration
day1 2020-12-01        50
day2 2020-12-02        40
day3 2020-12-26        45

In [96]:
# 对错误的数据进行替换或移除。以下实例会替换错误年龄的数据：
person = {
  "name": ['Google', 'Runoob' , 'Taobao'],
  "age": [50, 40, 12345]    # 12345 年龄数据是错误的
}

df = pd.DataFrame(person)

df.loc[2, 'age'] = 30 # 修改数据，相当于把第二行的age列重新赋值了

print(df.to_string())

     name  age
0  Google   50
1  Runoob   40
2  Taobao   30

In [101]:
# 将 age 大于 120 的设置为 120:
person = {
  "name": ['Google', 'Runoob' , 'Taobao'],
  "age": [50, 200, 12345]    
}
df = pd.DataFrame(person)

for x in df.index:
  if df.loc[x, "age"] > 120:
#     df.loc[x, "age"] = 120 #修改值
    df.drop(x, inplace = True) #删除行
print(df.to_string())

     name  age
0  Google   50

In [108]:
# 如果对应的数据是重复的，duplicated() 会返回 True，否则返回 False。

person = {
  "name": ['Google', 'Runoob', 'Runoob', 'Taobao'],
  "age": [50, 40, 40, 23]  
}
df = pd.DataFrame(person)
print("是否有重复数据:",df.duplicated(),"\n")

df.drop_duplicates(inplace = True)
print("删除重复数据后:",df)

是否有重复数据: 0    False
1    False
2     True
3    False
dtype: bool

删除重复数据后:      name  age
0  Google   50
1  Runoob   40
3  Taobao   23